.model tiny
.code
org 100h
VIDEOSEG equ 0B800h
;____________________________________________________________________________________________________________________________________________________
Start:    
    xor cx, cx            
	xor ch, ch
    mov cx, ds:[80h]
	mov si, 80h          
    mov di, 1600         
    
    call PrintChars      
    
    mov ax, 4c00h        
    int 21h 
;____________________________________________________________________________________________________________________________________________________
PrintChars proc
    mov ax, VIDEOSEG
    mov es, ax
    mov ah, 0CEh         

NextChar:
    lodsb                ; Загружает байт из ds:[si] в AL и инкрементирует SI
    mov es:[di], ax      ; Пишем символ и атрибут в видеопамять
    add di, 2            ; Переходим к следующему знакоместу (2 байта)
    loop NextChar        ; CX--, если не 0, прыгаем на NextChar
    
    ret                  ; Возврат в Start
PrintChars endp
;____________________________________________________________________________________________________________________________________________________

end Start